Tekla Open API Reference for Tekla Structures 2025
PluginBase.InputDefinition.InputTypeEnum Enumeration
 The possible input types for a plug-in.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum InputTypeEnum
Public Enumeration InputTypeEnum
Members
Member name | Value | Description
INPUT_ONE_POINT | 1 |  The input is one point (x,y,z).
INPUT_TWO_POINTS | 2 |  The input is two points.
INPUT_POLYGON | 3 |  The input is multiple points.
INPUT_ONE_OBJECT | 4 |  The input is one ID of any type.
INPUT_N_OBJECTS | 5 |  The input is N IDs of any type.
See Also
Reference
Tekla.Structures.Plugins Namespace